src/cf/Catalogs/CRM_ЗначенияКлассификаторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>CRM_ЗначенияКлассификаторов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>ChartOfCharacteristicTypes.CRM_Классификаторы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяШаблонаСКД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_ДополнительныеРеквизитыКлассификаторов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/ChartsOfCharacteristicTypes/CRM_Классификаторы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>CRM_Классификаторы</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.CRM_ЗначенияКлассификаторов</v8:Type>
				<v8:Type>cfg:CatalogRef.вогДизайныНоменклатуры</v8:Type>
				<v8:Type>cfg:CatalogRef.вогНоменклатурныеПозиции</v8:Type>
				<v8:Type>cfg:CatalogRef.вогЮридическиеЛица</v8:Type>
				<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
				<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
				<v8:Type>cfg:CatalogRef.вогТорговоеОборудование</v8:Type>
				<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
				<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
				<v8:Type>cfg:CatalogRef.вогКоллекцииНоменклатуры</v8:Type>
				<v8:Type>cfg:CatalogRef.вогКоммерческиеСоглашения</v8:Type>
				<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
				<v8:Type>cfg:CatalogRef.вогРаспределительныеЦентры</v8:Type>
				<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
				<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКлиенты</v8:Type>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОтображения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ВидыОтображенияКлассификаторов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФормирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФормированияСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРегламентноеЗадание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗаданиеGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьИсториюИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуемаяАналитика</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_АналитикаКлассификаторов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобоеРазмещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмещениеИмяГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмещениеФорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмещениеВыводитьЗаголовок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОтбораЗависимости</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановленаЗависимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоризонтальноеРазмещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеМожноОтметитьНаКарте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВФормеСписка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьКакПредставление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработчикПриИзменении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработчикНачалоВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Принадлежность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяТаблицы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/cf/CommonForms/CRM_ФормаПодбораЗначенийКлассификаторов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ЛогическоеВыражение") Тогда
		ЛогическоеВыражение = Параметры.ЛогическоеВыражение;		
	КонецЕсли;
	
	ЛогическоеВыражение = ?(ЗначениеЗаполнено(ЛогическоеВыражение), ЛогическоеВыражение, "И");
	
	// + Тищенко В.В.
	Если Параметры.Свойство("ВыбранныеГруппы") Тогда
		ВыбранныеГруппы.ЗагрузитьЗначения(Параметры.ВыбранныеГруппы);
	КонецЕсли;
	// - Тищенко В.В.
	
	ЗаполнитьДеревоКлассификаторов(Параметры.Принадлежность, Параметры.МассивЗначений, Параметры.МассивЗначенийРеквизитов, Отказ);
	УстановитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	СоответствиеЗначений			  = Новый Соответствие;
	МассивВыбранныхЗначений 		  = Новый Массив;
	МассивВыбранныхЗначенийРеквизитов = Новый Массив;
	// + Тищенко В.В.
	МассивВыбранныхГрупп			  = Новый Массив;
	// - Тищенко В.В.
	Для каждого СтрокаКлассификатора Из ДеревоКлассификаторов.ПолучитьЭлементы() Цикл
		// + Тищенко В.В.
		Если СтрокаКлассификатора.Пометка Тогда
			МассивВыбранныхГрупп.Добавить(СтрокаКлассификатора.Классификатор_Значение);
		КонецЕсли;
		// - Тищенко В.В.
		Для каждого СтрокаЗначения Из СтрокаКлассификатора.ПолучитьЭлементы() Цикл
			Если СтрокаЗначения.Пометка Тогда
				МассивВыбранныхЗначений.Добавить(СтрокаЗначения.Классификатор_Значение);
				МассивВыбранныхЗначенийРеквизитов.Добавить(СтрокаЗначения.ЗначениеРеквизита);
				
				СоответствиеЗначений.Вставить(СтрокаЗначения.Классификатор_Значение, СтрокаЗначения.ЗначениеРеквизита);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("ЛогическоеВыражение"	, ЛогическоеВыражение);
	Результат.Вставить("ЗначенияКлассификаторов", МассивВыбранныхЗначений);
	Результат.Вставить("ЗначенияРеквизитов"     , МассивВыбранныхЗначенийРеквизитов);
	Результат.Вставить("СоответствиеЗначений"   , СоответствиеЗначений);
	// + Тищенко В.В.
	Результат.Вставить("ЗначениеГрупп"   		,МассивВыбранныхГрупп);
	// - тищенко В.В.
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Развернуть(Команда)
	РазвернутьСтрокиДерева(Элементы.ДеревоКлассификаторов, "ДеревоКлассификаторов");	
КонецПроцедуры

&НаКлиенте
Процедура Свернуть(Команда)
	РазвернутьСтрокиДерева(Элементы.ДеревоКлассификаторов, "ДеревоКлассификаторов", Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура Информация(Команда)

	Элементы.ДеревоКлассификаторовИнформация.Пометка = Не Элементы.ДеревоКлассификаторовИнформация.Пометка;	
	УстановитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДеревоКлассификаторовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКлассификаторовПередУдалением(Элемент, Отказ)
	Отказ = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКлассификаторовПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоКлассификаторов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
		
	КонецЕсли;
	
	ЗаполнитьПометкиРекурсивно(ТекущиеДанные.ПолучитьЭлементы(), ТекущиеДанные.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКлассификаторовЗначениеРеквизитаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоКлассификаторов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
		
	КонецЕсли;
	
	ТекущиеДанные.Пометка = ЗначениеЗаполнено(ТекущиеДанные.ЗначениеРеквизита);
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции

&НаСервере
Процедура ЗаполнитьДеревоКлассификаторов(Принадлежность, МассивЗначений, МассивЗначенийРеквизитов, Отказ)
	
	ЭлементыДерева = ДеревоКлассификаторов.ПолучитьЭлементы();
	ЭлементыДерева.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CRM_ЗначенияКлассификаторов.Владелец КАК Классификатор,
		|	CRM_ЗначенияКлассификаторов.Ссылка КАК Значение,
		|	CRM_ЗначенияКлассификаторов.Владелец.ВидОтображения КАК ВидОтображения,
		|	CRM_ЗначенияКлассификаторов.Владелец.СпособФормирования КАК СпособФормирования,
		|	CRM_ЗначенияКлассификаторов.ДополнительныйРеквизит КАК ДополнительныйРеквизит,
		|	CRM_ЗначенияКлассификаторов.Описание КАК Описание
		|ИЗ
		|	Справочник.CRM_ЗначенияКлассификаторов КАК CRM_ЗначенияКлассификаторов
		|ГДЕ
//START Кайдашов 08/07/19 353		
		|	НЕ CRM_ЗначенияКлассификаторов.ПометкаУдаления
//END Кайдашов
		|	%%УсловиеПринадлежность%%
		|
		|УПОРЯДОЧИТЬ ПО
		|	CRM_ЗначенияКлассификаторов.Владелец.РеквизитДопУпорядочивания,
		|	CRM_ЗначенияКлассификаторов.РеквизитДопУпорядочивания
		|ИТОГИ ПО
		|	Классификатор";
	
	
	ТекстУсловия = "";		
	Если Принадлежность <> Неопределено Тогда
		ТекстУсловия = "И CRM_ЗначенияКлассификаторов.Владелец В
			|(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	CRM_КлассификаторыПринадлежность.Ссылка
			|ИЗ
			|	ПланВидовХарактеристик.CRM_Классификаторы.Принадлежность КАК CRM_КлассификаторыПринадлежность
			|ГДЕ
//START Кайдашов 08/07/19 353			
			|	CRM_КлассификаторыПринадлежность.ИмяТаблицы В (&Принадлежность) И НЕ CRM_КлассификаторыПринадлежность.Ссылка.ПометкаУдаления)";
//END Кайдашов		
		Запрос.УстановитьПараметр("Принадлежность", Принадлежность);
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%%УсловиеПринадлежность%%", ТекстУсловия);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Список значений классификаторов пуст. '"),,,, Отказ);	
		Возврат;
		
	КонецЕсли;
	
	ВыборкаКлассификатор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаКлассификатор.Следующий() Цикл
		
		СтрокаКлассификатор = ЭлементыДерева.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКлассификатор, ВыборкаКлассификатор);
		
		СтрокаКлассификатор.Классификатор_Значение = ВыборкаКлассификатор.Классификатор;
		СтрокаКлассификатор.ИндексКартинки = 1;
		
		// + Тищенко В.В.
		Если ВыбранныеГруппы.Количество() <> 0 Тогда
			Если ВыбранныеГруппы.НайтиПоЗначению(ВыборкаКлассификатор.Классификатор) <> Неопределено Тогда
				СтрокаКлассификатор.Пометка = Истина;
			КонецЕсли;
		КонецЕсли;
		// - Тищенко В.В.
		
		ВыборкаЗаписи = ВыборкаКлассификатор.Выбрать();
		Пока ВыборкаЗаписи.Следующий() Цикл
			СтрокаЗначение = СтрокаКлассификатор.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЗначение, ВыборкаЗаписи);
			
			СтрокаЗначение.Классификатор_Значение = ВыборкаЗаписи.Значение;
			СтрокаЗначение.ИндексКартинки = 2;
			
			Если МассивЗначений <> Неопределено Тогда
				ИндексЭлементаМассиваЗначений = МассивЗначений.Найти(ВыборкаЗаписи.Значение);
				Если ИндексЭлементаМассиваЗначений <> Неопределено Тогда
					СтрокаЗначение.Пометка 			 = Истина;	
					СтрокаЗначение.ЗначениеРеквизита = МассивЗначенийРеквизитов[ИндексЭлементаМассиваЗначений];
					
				КонецЕсли;
				// + Тищенко В.В.
			Иначе
				СтрокаЗначение.Пометка = СтрокаКлассификатор.Пометка;
				// - Тищенко В.В.
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
		
КонецПроцедуры // ЗаполнитьДеревоКлассификаторов()

&НаКлиенте
Процедура ЗаполнитьПометкиРекурсивно(ЭлементыДерева, Пометка)

	Для каждого СтрокаДерева Из ЭлементыДерева Цикл
		СтрокаДерева.Пометка = Пометка;		
		ЗаполнитьПометкиРекурсивно(СтрокаДерева.ПолучитьЭлементы(), Пометка);
	
	КонецЦикла;	

КонецПроцедуры // ЗаполнитьПометкиРекурсивно()

&НаКлиенте
Процедура РазвернутьСтрокиДерева(ЭлементДерево, ИмяРеквизитаФормы, Развернуть = Истина)
	
	СтрокиДерева = ЭтотОбъект[ИмяРеквизитаФормы].ПолучитьЭлементы();
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		Если Развернуть Тогда
			ЭлементДерево.Развернуть(СтрокаДерева.ПолучитьИдентификатор(), Истина);
		Иначе
			ЭлементДерево.Свернуть(СтрокаДерева.ПолучитьИдентификатор());
		КонецЕсли;
							
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДоступность(Форма)

	ПометкаВидимости = Форма.Элементы.ДеревоКлассификаторовИнформация.Пометка;
	Форма.Элементы.ПраваяКолонка.Видимость = ПометкаВидимости;	

КонецПроцедуры // УстановитьВидимостьДоступность()

#КонецОбласти
